chiconghvan/esp-agent/sdkconfig.defaults
# ===========================================================================
# ESP-IDF Default Configuration cho ESP-Agent
# Target: ESP32-C3 Super Mini
# ===========================================================================

# --- Target ---
CONFIG_IDF_TARGET="esp32c3"

# --- Flash Size (ESP32-C3 Super Mini = 4MB) ---
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# --- Partition Table ---
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# --- SPIFFS ---
CONFIG_SPIFFS_MAX_PARTITIONS=1

# --- Wi-Fi ---
CONFIG_ESP_WIFI_SSID=""
CONFIG_ESP_WIFI_PASSWORD=""

# --- SNTP ---
CONFIG_LWIP_SNTP_MAX_SERVERS=1

# --- HTTP Client ---
CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=y
CONFIG_ESP_TLS_USING_MBEDTLS=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

# --- cJSON ---
CONFIG_CJSON_NESTING_LIMIT=20

# --- FreeRTOS ---
CONFIG_FREERTOS_HZ=1000

# --- Log Level ---
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_DEFAULT_LEVEL=3

# --- Stack Size (cần lớn vì các buffers JSON/HTTP) ---
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384

# --- Watchdog (phải > Telegram polling timeout + buffer) ---
CONFIG_ESP_TASK_WDT_TIMEOUT_S=60
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=n

# --- Newlib ---
CONFIG_NEWLIB_TIME_SYSCALL_USE_NONE=n

# --- OTA & Rollback ---
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
